{
    "fr": {
        "last-updated": "Dernière mise à jour : ",
        
        "job-title": "@AdriKat - Développeur",
        "job-subtitle": "Ingénieur du numérique - Développeur et concepteur de jeux - Développeur de logiciels",
        "nav-seeking": "Recherches actuelles",
        "nav-profile": "Mon Profil",
        "nav-games": "Mes Jeux",
        "nav-about": "À propos",
        "nav-contact": "Contact",
        "title-seeking": "Recherches actuelles",
        "title-profile": "Mon Profil",
        "title-games": "Mes Jeux",
        "title-about": "À propos",
        "title-contact": "Contact",

        "seeking-position-title": "Stage Développeur de Jeux vidéo",
        "seeking-position-subtitle": "Stage de fin d'études (6 mois)",
        "seeking-date": "À partir du 08 Février 2025",
        "seeking-locations": "Royaume-Uni, Canada, Irelande, Pays-Bas, Belgique, Roumanie (préféré mais non limité à)",

        "cv-button": "Intéressé ? Prenez le raccourci vers mon CV !",

        "profile-subtitle": "Vous avez un projet en tête dans le domaine du game dev ou du software ?<br>N'hésitez pas à me contacter par <a href=\"mailto:adrien.schroedel@telecom-sudparis.eu\">mail</a> ou par <a href=\"tel:+33781565695\">téléphone</a> !",

        "profile-column-1-head": "Maîtrise de multiples <strong>languages de programmation</strong> parmi...",
        "profile-column-1-1": "C++ (avec notamment <em>Unreal Engine 5</em>)",
        "profile-column-1-2": "C# (avec <em>Unity</em>)",
        "profile-column-1-3": "C",
        "profile-column-1-4": "Python",
        "profile-column-1-5": "Java",
        "profile-column-1-6": "Bash (dans un environnement <em>Linux</em>)",
        "profile-column-1-7": "HTML/CSS/PHP/JavaScript (avec Symfony pour le web)",
        
        "profile-column-2-head": "Maîtrise de multiples <strong>outils</strong> de gestion de projet et burautique parmi...",
        "profile-column-2-1": "Gestionnaire de version GIT (+ LFS)",
        "profile-column-2-2": "Suite Microsoft Office",
        "profile-column-2-3": "Suite Google",
        "profile-column-2-4": "Microsoft Office",

        "portfolio-description": "Mon portfolio regorge de tous les projets auxquels j'ai participé, seul ou en équipe, durant mes études d'ingénieur du numérique à Télécom SudParis, en tant que projet scolaire ou personnel. Vous y trouverez principalement des jeux vidéo dans cette section !",
        "portfolio-pinned-subsection": "Jeux épinglés <i class=\"ms-2 fa-solid fa-thumbtack\"></i>",
        "portfolio-other-games-subsection": "Mes autres jeux",
        "portfolio-warning": "Attention : Si le chargement des projets ne s'est pas faite correctement, veuillez <a href=\".\">rafraîchir la page</a>.",
        
        "about-p1": "Bonjour et bienvenue sur mon portfolio ! Je m'appelle Adrien Schroedel, passionné par le software et le game dev, j'ai tout naturellement intégré une école (Télécom SudParis) pour devenir ingénieur du numérique...<br/>Tout au long de ma formation, j'ai participé à de nombreux <a href=\"#portfolio\">projets de création de jeux vidéo</a>.",
        "about-p2": "Mon plaisir vient non seulement d'apporter mon expertise sur les moteurs de jeu les plus utilisés sur le marché, mais aussi de collaborer harmonieusement avec une équipe pluridisciplinaire pour offrir une œuvre digne du 10me art à tout type de publics.",
        "about-p3": "Mon rêve est d'intégrer une équipe ambitieuse partageant des valeurs fortes et une cohésion hors du commun. Dès lors que la motivation est présente, je pense que nous pouvons accomplir des merveilles.",

        "about-resume-title": "Mon CV",

        "contact-subtitle": "Une question dans un domaine particulier comme le jeu vidéo, logiciel ou même tout autre chose ? <br/>N'hésitez pas à me contacter, je serai ravi d'en discuter avec vous !",

        "projects-technologies": "Compétences et technologies utilisées",
        "projects-button-close": "<i class=\"fas fa-xmark fa-fw\"></i>Fermer",

        "project-sorting-bubble-title": "Sorting Bubble",
        "project-sorting-bubble-date": "Janvier 2025",
        "project-sorting-bubble-subtitle": "Vivez l'aventure d'une petite bulle dans l'univers de fonctions de tri déjantés !",
        "project-sorting-bubble-description-1": "<p>Sorting Bubble a été développé à l'occasion de la <a href=\"https://globalgamejam.org/jam-sites/2025/telecom-sudparis\">Global Game Jam qui s'est déroulé à Télécom SudParis</a> du 24 au 26 Janvier. La particularité de cet évènement est qu'il ait été organisé par nous, des étudiants! Je tiens à remercier de tout coeur <a href=\"https://www.linkedin.com/posts/maxime-sansane_last-week-i-had-the-chance-to-organise-t%C3%A9l%C3%A9com-activity-7289918024784990209-EpaY?utm_source=share&utm_medium=member_desktop&rcm=ACoAAD18u4sBa7MoCrgRuDr8SXINMEpywk0Hbmo\" target=\"_blank\">Maxime Sansané</a> pour avoir pris les devants et avoir permit à cet évènement d'exister !</p>",
        "project-sorting-bubble-description-2": "<p>Sorting Bubble est un jeu puzzle ou votre mission est d'incarner une petite bulle pour trier des nombres à travers des fonctions (des niveaux). Parsemés avec des pièges et outils pour s'en sortir, vous allez devoir trouver une méthode en utilisant différents types de buffers pour passer à travers des obstacles comme des squishers qui ne vous ne laisseront pas passer si vous portez un nombre.</p><p>Nous sommes très satifaits du résultat : même en l'absence d'artiste dans l'équipe, nous avons décidé de prendre un style simple et efficace qui fonctionne très bien pour notre type de jeu.</p><p>J'ai beaucoup apprécié ma contribution sur ce projet : le développement des différents buffers, mais également la mise à disposition de scripts variés pour permettre une édition des levels de plus haut niveau. Cela a permis à d'autres membres de l'équipe et parfois moi-même de pouvoir exercer le job d'un level designer plus aisément. Ce que j'ai également apprécié dans ce projet ont été le développement de scripts d'animations, comme par exemple la recompilation et également la création d'UI comme l'écran de défaite.</p><p>N'hésitez pas à le tester sur itch avec le bouton ci-dessous !</p>",
        "project-sorting-bubble-action-button-1": "Jouer/Page du projet (Itch.io)",

        "project-irma-rnark-title": "Iram Rnark",
        "project-irma-rnark-date": "Novembre-Decembre 2024",
        "project-irma-rnark-subtitle": "Prédisez le futur de vos clients en choississant les bonnes cartes",
        "project-irma-rnark-description-1": "<p>Lors de l'incroyable évènement <strong>Unijam 2024</strong> qui s'est déroulé du 28 novembre au 1er décembre, notre talentueuse équipe a créé <strong>Iram Rnark</strong>—le jeu qui a fièrement remporté le Prix du Public ! Dans cette expérience unique, les joueurs se glissent dans la peau d'Iram Rnark, une voyante sans aucun pouvoir surnaturel, qui s'efforce de prévoir l'avenir de ses clients. À travers des dialogues engageants et des observations aiguisées de personnages excentriques et divertissants, elle sélectionne soigneusement les cartes qu'elle croit révéler leurs futurs récits.</p>",
        "project-irma-rnark-description-2": "<p><strong>Iram Rnark</strong> a été une expérience très enrichissante pour la construction de l'esprit d'équipe et la collaboration. En tant que développeur principal durant l'évènement, j'ai guidé l'équipe sur le côté codage avec une attitude de soutien et accessible. J'ai fait en sorte que tout le monde contribue non seulement mais se sente également à l'aise avec ce qu'il faisait. J'étais toujours disponible pour aider dès que quelqu'un avait une question ou rencontrait un défi avec les parties techniques ou structurelles du projet.</p><p>Le projet a été mené à bien dans une superbe ambiance, et nous avons tous pris beaucoup de plaisir à travailler dessus ensemble.</p>",
        "project-irma-rnark-action-button-1": "Jouer/Page du projet (Itch.io)",

        "project-space-shooter-game-title": "Space Shooter Game",
        "project-space-shooter-game-date": "Novembre 2024",
        "project-space-shooter-game-subtitle": "À la découverte d'un nouveau moteur de jeu",
        "project-space-shooter-game-description-1": "<p>Ce jeu est le fruit d'un challenge que j'ai décidé de relever durant le mois de novembre 2024 : apprendre à utiliser le <strong>nouveau moteur de jeu Flame</strong> en créant un jeu en 2 semaines.</p>",
        "project-space-shooter-game-description-2": "<p>Le principal but était de monter un jeu simple tout en touchant à un maximum de fonctionnalités qu'offre <strong>Flame</strong> et notamment comprendre sa structure de <em>composants</em> pouvant s'encastrer les uns les autres.</p><p>J'ai aussi pu mettre en pratique l'intégration continue avec GitHub pour maintenir une version jouable sur GitHub pages et automatiser le déploiement à chaque mise à jour.</p>",
        "project-space-shooter-game-action-button-1": "Jouer (GitHub Page)",
        "project-space-shooter-game-action-button-2": "Consulter le projet (GitHub)",

        "project-the-kairi-invasion-title": "The Kairi Invasion",
        "project-the-kairi-invasion-date": "Depuis Octobre 2024",
        "project-the-kairi-invasion-subtitle": "Un jeu à la shoot em up où vous devez défendre votre puissance économique avec des burgers",
        "project-the-kairi-invasion-description-1": "<p><strong>The Kairi Invasion</strong> tient son origine d'un simple travail pratique d'école où nous étions attendu de faire un jeu de tir (SCHMUP). Une fois le projet terminé du point de vue scolaire, j'ai voulu continuer à le paufiner afin d'avoir de meilleurs images (fond d'écran, ennemis, projectiles..).</p>",
        "project-the-kairi-invasion-description-2": "<p>Je me suis surtout concentré sur le côté <em>game juice</em>, incluant par exemple, une interface utilisateur agréable et satisfaisante, un bon retour et bonne expérience utilisateur.. Les animations que vous pouvez apercevoir en jouant ont été codé dans Unity, notamment grâce à des coroutines.</p>",
        "project-the-kairi-invasion-action-button-1": "The Kairi Invasion page (GitHub)",

        "project-find-mocha-title": "Find Mocha",
        "project-find-mocha-date": "Depuis Novembre 2023",
        "project-find-mocha-subtitle": "Un jeu de plateforme 2D où vous incarnez un ours mignon à la recherche de son ami",
        "project-find-mocha-description-1": "<p><strong>Find Mocha</strong> a été mon projet personnel préféré jusqu'à présent. En effet, la motivation pour ce projet était au départ de le livrer en cadeau à un ami très proche. Cela explique d'ailleurs pourquoi la motivation de départ que j'avais pour celui-ci était si élevée.</p>",
        "project-find-mocha-description-2": "<p>Dans ce petit jeu de plateforme fait avec le moteur Unity, vous incarnez un petit ours nommé Milk qui explore des montagnes sucrées pour retrouver son ami Mocha.</p><p>Divers types de powerups vous aideront dans votre voyage, mais attention aux monstres de mauvaises pensées !</p><p>Vous pouvez y jouer en téléchargeant le jeu sur GitHub.</p>",
        "project-find-mocha-action-button-1": "Page du projet (GitHub)",

        "project-rupture-title": "Rupture",
        "project-rupture-date": "Janvier - Juin 2024",
        "project-rupture-subtitle": "Un jeu vidéo impactant sur le thème du Développement Durable",
        "project-rupture-description-1": "<p><strong>Rupture</strong> est un projet réalisé par un groupe de 4 étudiants dans le cadre d'une formation d'ingénieur du numérique à Télécom SudParis.</p>",
        "project-rupture-description-2": "<p>Dans ce jeu de type narratif, vous incarnez le point de vue d'un modeste robot observant l'état de la société dans un futur proche. Alors que votre mission simple est d'aider un jeune couple, votre tâche se métamorphose alors de manière inattendue en une mission bien plus importante que de simple divertissement.</p><p>L'objectif principal de ce projet était notamment d'apprendre à utiliser le moteur UnrealEngine 5 pour créer un jeu vidéo impactant sur le thème du Développement Durable.</p><p>Le rapport du projet est disponible.</p>",
        "project-rupture-action-button-1": "Accéder au Rapport de Rupture",

        "project-shipping-time-title": "Shipping Time",
        "project-shipping-time-date": "Avril 2024",
        "project-shipping-time-subtitle": "Contrôlez le temps autant que la météo dans ce jeu de rythme à réaction",
        "project-shipping-time-description-1": "Développé en 48h durant l'évènement <a href=\"https://gate.wp.telecom-sudparis.eu/projet/int-game-jam/\"><strong>INT Game Jam 2024</strong></a> qui a été géré de façon autonome par un groupe de 9 étudiants, <strong>Shipping Time</strong> a été pensé et conçu par une équipe de 5 jammeurs dans le thème de cette année \"Jouer avec le temps\".",
        "project-shipping-time-description-2": "<p class=\"mb-4\">Dans ce jeu de rythme à réaction, vous incarnez un bateau qui doit contrôler le temps autant que la météo pour livrer des colis à temps.</p><p class=\"mb-4\">Ayant eu quelques difficultés techniques, le jeu n'a pas pu être achevé comme nous l'avons souhaité, mais malgré quelques bugs, nous avons été satisfaits d'un jeu ayant une boucle de jeu terminée et qui correspondait au global à ce qu'on attendait.</p>",
        "project-shipping-time-action-button-1": "Page du projet (Itch.io)",

        "project-the-legend-of-blo-title": "The Legend Of Blo : the voice in your head",
        "project-the-legend-of-blo-date": "Janvier 2024",
        "project-the-legend-of-blo-subtitle": "Arrivez au bout de votre quête tout en supportant un narrateur chevronné",
        "project-the-legend-of-blo-description-1": "Développé en 48h durant la <a href=\"https://gate.wp.telecom-sudparis.eu/projet/int-game-jam/\"><strong>Global Game Jam 2024</strong></a>, c'est une équipe de 6 étudiants qui a donné naissance à <strong>The Legend Of Blo : the voice in your head</strong>. Un jeu fourré de bugs (intentionnels ?) orienté narratif où un narrateur plutôt spécial vous accompagne dans votre quête. Ce jeu a été donc réalisé face au thème de l'année \"Make me laugh\".",
        "project-the-legend-of-blo-description-2": "<p class=\"mb-4\">Le projet a été très amusant à produire, nous avons beaucoup rigolé avec toute l'équipe durant le développement de ce jeu. Allant des bugs intentionnels aux non-intentionnels, les rires circulaient sur la table. Nous avons donc appris à reconnaître une chose importante ce jour là : ce n'est pas un bug, c'est une feature !</p><p class=\"mb-4\">Nous avons été très fier du jeu à son état final. Je suis personnellement très fier d'avoir réussi à monter le système de dialogue modulaire pour ce jeu.</p>",
        "project-the-legend-of-blo-action-button-1": "Page du projet (Itch.io)",

        "project-magic-circus-title": "Magic Circus",
        "project-magic-circus-date": "Novembre 2023 - Janvier 2024",
        "project-magic-circus-subtitle": "Guidez et coordonnez vos unités pour capturer le drappeau grâce à leurs compétences spéciales",
        "project-magic-circus-description-1": "Ce projet a été réalisé en duo dans le cadre de notre deuxième année d'école d'ingénieur du numérique, dans le cours d'Architectures et Moteurs de Jeux Vidéos à Télécom SudParis. La création de ce jeu nous a permis de prouver nos compétences en matière d'utilisation du moteur Unity pour créer un jeu simple présentant une qualité minimale.",
        "project-magic-circus-description-2": "Pour son développement, nous avons du associer nos expériences passées avec Unity avec la découverte de nouveaux outils permise par le module proposé par notre école (notamment le Nav-Mesh qui permet la navigation d'un ordinateur sur un terrain).",
        "project-magic-circus-action-button-1": "Page du projet (Itch.io)",

        "project-translimation-title": "Translimation",
        "project-translimation-date": "Novembre 2023",
        "project-translimation-subtitle": "Incarnez un petit slime dans tous ses états",
        "project-translimation-description-1": "Ce jeu a été réalisé en 48 heures à l'occasion de l'évènement <a href=\"https://itch.io/jam/unijam2023\"><strong>Unijam FR 2023</strong></a> avec le thème de cette année \"Tout se tranforme\".",
        "project-translimation-description-2": "L'idée que nous avons eu a été alors d'incarner un petit slime de laboratoire où son but est de se forger sa propre liberté en s'échappant du labo. Mais un slime ça colle, et ça ne saute pas haut. Pas de panique, il existe des sources de chaleur et de froid qui altereront votre état. Chaque état a ses avantages et ses inconvénients ! Mais attention à ne pas prendre trop de temps : chaque salle a sa propre température, et elle vous ramènera constament au même état après un certain temps.",
        "project-translimation-action-button-1": "Page du projet (Itch.io)",

        "project-exploding-tree-title": "Exploding Tree",
        "project-exploding-tree-date": "Février 2023",
        "project-exploding-tree-subtitle": "Défendez l'arbre sacré dans ce tower défense où git à eu raison de nous",
        "project-exploding-tree-description-1": "Ce jeu a été réalisé en 48 heures dans une équipe de 6 à l'occasion de la <a href=\"https://itch.io/jam/unijam2023\"><strong>Global Game Jam 2023</strong></a> avec le thème de cette année \"Roots\".",
        "project-exploding-tree-description-2": "<p class=\"mb-4\">Cette game jam a été la première pour toute l'équipe. L'utilisation de GIT (logiciel de gestion de version de fichier, indispensable pour travailler en équipe) était également nouvelle à ce temps. C'est à ce moment là que nous avons commencé à le prendre en main.</p><p class = \"mb-4\">Le jeu n'a finalement pas pu aboutir, car trop de problèmes avaient été rencontrés avec GIT. Malheureusement, à cet époque, nous ne connaissions pas assez les méthodes pour s'en sortir, mais il est intéressant de remarquer que, restrospectivement à aujourd'hui, nous aurions pu corriger le problème d'avant avec notre maîtrise actuelle.</p>",
        "project-exploding-tree-action-button-1": "Page du projet (Github)"
    },
    "en": {
        "last-updated": "Last update: ",
        
        "job-title": "@AdriKat - Developer",
        "job-subtitle": "Digital engineer - Game developer and designer - Software developer",
        "nav-seeking": "Currently seeking",
        "nav-profile": "My Profile",
        "nav-games": "My Games",
        "nav-about": "About Me",
        "nav-contact": "Contact",
        "title-seeking": "Currently seeking",
        "title-profile": "My Profile",
        "title-games": "My Games",
        "title-about": "About Me",
        "title-contact": "Contact",

        "seeking-position-title": "Game Developer Internship",
        "seeking-position-subtitle": "End of studies internship (6 months)",
        "seeking-date": "From February 8th, 2025",
        "seeking-locations": "United Kingdom, Canada, Ireland, Netherlands, Belgium, Romania (preferred but not limited to)",

        "cv-button": "Interested ? Take the shortcut to my resume !",

        "profile-subtitle": "Have a project in mind in the field of game or software development ?<br>Do not hesitate to contact me by <a href=\"tel:+33781565695\">phone</a> or <a href=\"mailto:adrien.schroedel@telecom-sudparis\">email</a> !",
        
        "profile-column-1-head": "Mastery of multiple <strong>programming languages</strong> including...",
        "profile-column-1-1": "C++ (including <em>Unreal Engine 5</em>)",
        "profile-column-1-2": "C# (with <em>Unity</em>)",
        "profile-column-1-3": "C",
        "profile-column-1-4": "Python",
        "profile-column-1-5": "Java",
        "profile-column-1-6": "Bash (in a <em>Linux</em> environment)",
        "profile-column-1-7": "HTML/CSS/PHP/JavaScript (with Symfony for the web)",
        
        "profile-column-2-head": "Mastery of multiple <strong>project management and office tools</strong> including...",
        "profile-column-2-1": "GIT version manager (+ LFS)",
        "profile-column-2-2": "Microsoft Office Suite",
        "profile-column-2-3": "Google Suite",
        "profile-column-2-4": "Microsoft Office",

        "portfolio-description": "My portfolio is full of all the projects I have been able to carry out, alone or in teams, during my digital engineering studies at Télécom SudParis, as a school or personal project. You will mainly find video games in this section!",
        "portfolio-pinned-subsection": "Pinned Games <i class=\"ms-2 fa-solid fa-thumbtack\"></i>",
        "portfolio-other-games-subsection": "My Other Games",
        "portfolio-warning": "Warning: The projects might not load correctly, please <a href=\".\">refresh the page</a> if that's the case.",
        
        "about-p1": "Hello and welcome to my portfolio ! My name is Adrien Schroedel, passionate about software and game development, I managed to join a digital engineer school (Télécom SudParis) to become one...<br/>Throughout my training, I participated (and still participating) in many <a href=\"#portfolio\">video game creation projects</a>.",
        "about-p2": "My pleasure comes not only from bringing my expertise on the most used game engines on the market, but also from harmoniously collaborating with a multidisciplinary team to offer a work worthy of the 10th art to all types of audiences.",
        "about-p3": "My dream is to join an ambitious team sharing strong values and an extraordinary cohesion. As long as motivation is present, I think we can accomplish wonders.",
        
        "about-resume-title": "My resume",
        
        "contact-subtitle": "A question in a particular field such as video games, software or even something else ? <br/>Engage the discussion, I will be happy to discuss it with you !",
        
        "projects-technologies": "Skills and technologies used",
        "projects-button-close":"<i class=\"fas fa-xmark fa-fw\"></i>Close",

        "project-sorting-bubble-title": "Sorting Bubble",
        "project-sorting-bubble-date": "January 2025",
        "project-sorting-bubble-subtitle": "Experience the adventure of a small bubble in the universe of crazy sorting functions!",
        "project-sorting-bubble-description-1": "<p>Sorting Bubble was developed on the occasion of the <a href=\"https://globalgamejam.org/jam-sites/2025/telecom-sudparis\">Global Game Jam that took place at Télécom SudParis</a> from January 24th to 26th. The particularity of this event is that it was organized by us, students! I would like to thank from the bottom of my heart <a href=\"https://www.linkedin.com/posts/maxime-sansane_last-week-i-had-the-chance-to-organise-t%C3%A9l%C3%A9com-activity-7289918024784990209-EpaY?utm_source=share&utm_medium=member_desktop&rcm=ACoAAD18u4sBa7MoCrgRuDr8SXINMEpywk0Hbmo\" target=\"_blank\">Maxime Sansané</a> for taking the lead and making this event exist !</p>",
        "project-sorting-bubble-description-2": "<p>Sorting Bubble is a puzzle game where your mission is to embody a small bubble to sort numbers through functions (levels). Sprinkled with traps and tools to get out of it, you will have to find a method using different types of buffers to pass through obstacles like squishers that won't let you pass if you carry a number.</p><p>We are very satisfied with the result: even in the absence of an artist in the team, we decided to take a simple and effective style that works very well for our type of game.</p><p>I enjoyed my contribution to this project: the development of the different buffers, but also the provision of various scripts to allow higher-level level editing. This allowed other team members and sometimes myself to exercise the job of a level designer more easily. What I also appreciated in this project was the development of animation scripts, such as the recompilation and also the creation of UI like the defeat screen.</p><p>Don't hesitate to check it out with the button below!</p>",
        "project-sorting-bubble-action-button-1": "Play/Project page (Itch.io)",

        "project-irma-rnark-title": "Iram Rnark",
        "project-irma-rnark-date": "November-December 2024",
        "project-irma-rnark-subtitle": "Predict the future of your clients by choosing the right cards",
        "project-irma-rnark-description-1": "<p>During the amazing <strong>Unijam 2024</strong> event held from November 28th to December 1st, our talented team created <strong>Iram Rnark</strong>—the game that proudly won the Audience Choice Award! In this unique experience, players step into the role of Iram Rnark, a clairvoyant without any supernatural abilities, who strives to foresee her clients' futures. Through engaging dialogues and keen observations of quirky and entertaining characters, she carefully selects the cards she believes will reveal their future stories.</p>",
        "project-irma-rnark-description-2": "<p><strong>Iram Rnark</strong> was a very valuable experience for building teamwork and collaboration. As the lead developer during the event, I guided the team on the coding side with a supportive and approachable attitude. I made it a priority to ensure that everyone not only contributed but also felt comfortable with what they were doing. I was always available to help whenever someone had a question or faced a challenge with the technical or structural parts of the project.</p><p>The project was completed in a great atmosphere, and we all had a lot of fun working on it together.</p>",
        "project-irma-rnark-action-button-1": "Play/Project page (Itch.io)",

        "project-space-shooter-game-title": "Space Shooter Game",
        "project-space-shooter-game-date": "November 2024",
        "project-space-shooter-game-subtitle": "A new game engine discovery",
        "project-space-shooter-game-description-1": "<p>This game is the result of a challenge I decided to take up during the month of November 2024: learn to use the <strong>new Flame game engine</strong> by creating a game in 2 weeks.</p>",
        "project-space-shooter-game-description-2": "<p>The main goal was to build a simple game while touching as many features as possible that <strong>Flame</strong> offers and notably understand its <em>components</em> structure that can fit into each other.</p><p>I was also able to put into practice continuous integration with GitHub to maintain a playable version on GitHub pages and automate deployment at each update.</p>",
        "project-space-shooter-game-action-button-1": "Play (GitHub Page)",
        "project-space-shooter-game-action-button-2": "Consult the project (GitHub)",

        "project-the-kairi-invasion-title": "The Kairi Invasion",
        "project-the-kairi-invasion-date": "From October 2024",
        "project-the-kairi-invasion-subtitle": "A shoot them up style game where you shall defend your economical power with burgers",
        "project-the-kairi-invasion-description-1": "<p><strong>The Kairi Invasion</strong> was at first a simple school exercice. We were excpected to build a small SCHMUP project to warm up for the year. Once the project was completed I decided to continue the project just a bit to have better visuals (background, enemies, projectiles...).</p>",
        "project-the-kairi-invasion-description-2": "<p>In this project I mainly focused on the <em>game juice</em>, that includes for example a satisfaying and pleasant UI, player feedback and good user experience. All the animations you can see while playing the game was coded in Unity mainly with Coroutines</p>",
        "project-the-kairi-invasion-action-button-1": "The Kairi Invasion page (GitHub)",

        "project-find-mocha-title": "Find Mocha",
        "project-find-mocha-date": "From November 2023",
        "project-find-mocha-subtitle": "An 2D platformer where you play as a cute bear looking for his friend",
        "project-find-mocha-description-1": "<p><strong>Find Mocha</strong> has been my personal favourite project so far. In fact, the motivation for this project were at first to deliver it as a present to a very close friend. That may explain why the starting motivation I had for this one was that high.</p>",
        "project-find-mocha-description-2": "<p>In this little platformer all code home-made, you play as a little bear named Milk that explores sweet mountains to find his friend Mocha.</p><p>Different types of powerups will help you through your journey, but beware of the bad thoughts monsters !</p><p>You can play by downloading the game on GitHub.</p>",
        "project-find-mocha-action-button-1": "Find Mocha page (GitHub)",

        "project-rupture-title": "Rupture",
        "project-rupture-date": "January - June 2024",
        "project-rupture-subtitle": "An impactful video game on the theme of Sustainable Development",
        "project-rupture-description-1": "<p><strong>Rupture</strong> is a project carried out by a group of 4 students as part of a training as a digital engineer at Télécom SudParis.</p>",
        "project-rupture-description-2": "<p>In this narrative-style game, you embody the point of view of a humble robot observing the status of society in the near future. While your simple mission is to help a young couple, your task then unexpectedly metamorphoses into a much more important one than mere entertainment.</p><p>The primary objective of this project was notably to learn how to use the UnrealEngine 5 engine to create an impactful video game on the theme of Sustainable Development.</p><p>The report of the project is available.</p>",
        "project-rupture-action-button-1": "Access Rupture Report",

        "project-shipping-time-title": "Shipping Time",
        "project-shipping-time-date": "April 2024",
        "project-shipping-time-subtitle": "Control time as much as the weather in this rhythm reaction game",
        "project-shipping-time-description-1": "Developed in 48 hours during the <a href=\"https://gate.wp.telecom-sudparis.eu/projet/int-game-jam/\"><strong>INT Game Jam 2024</strong></a> event which was managed autonomously by a group of 9 students, <strong>Shipping Time</strong> was conceived and designed by a team of 5 jammers in this year's theme \"Playing with time\".",
        "project-shipping-time-description-2": "<p class=\"mb-4\">In this rhythm reaction game, you embody a boat that must control time as much as the weather to deliver packages on time.</p><p class=\"mb-4\">Having had some technical difficulties, the game could not be completed as we wished, but despite some bugs, we were satisfied with a game having a completed gameplay loop and which corresponded globally to what we expected.</p>",
        "project-shipping-time-action-button-1": "Project page (Itch.io)",

        "project-the-legend-of-blo-title": "The Legend Of Blo : the voice in your head",
        "project-the-legend-of-blo-date": "January 2024",
        "project-the-legend-of-blo-subtitle": "Complete your quest while supporting a seasoned narrator",
        "project-the-legend-of-blo-description-1": "Developed in 48 hours during the <a href=\"https://gate.wp.telecom-sudparis.eu/projet/int-game-jam/\"><strong>Global Game Jam 2024</strong></a>, it is a team of 6 students who gave birth to <strong>The Legend Of Blo : the voice in your head</strong>. A game full of bugs (intentional ?) narrative-oriented where a rather special narrator accompanies you in your quest. This game was therefore created in the face of this year's theme \"Make me laugh\".",
        "project-the-legend-of-blo-description-2": "<p class=\"mb-4\">The project was very fun to produce, we laughed a lot with the whole team during the development of this game. From intentional to unintentional bugs, laughter circulated on the table. We therefore learned to recognize an important thing that day: it's not a bug, it's a feature !</p><p class=\"mb-4\">We were very proud of the game in its final state. I am personally very proud to have managed to set up the modular dialogue system for this game.</p>",
        "project-the-legend-of-blo-action-button-1": "Project page (Itch.io)",

        "project-magic-circus-title": "Magic Circus",
        "project-magic-circus-date": "November 2023 - January 2024",
        "project-magic-circus-subtitle": "Guide and coordinate your units to capture the flag using their special skills",
        "project-magic-circus-description-1": "This project was carried out in pairs as part of our second year of digital engineering school, in the Game Architectures and Engines course at Télécom SudParis. The creation of this game allowed us to prove our skills in using the Unity engine to create a simple game with minimal quality.",
        "project-magic-circus-description-2": "For its development, we had to combine our past experiences with Unity with the discovery of new tools made possible by the module offered by our school (notably the Nav-Mesh which allows the navigation of a computer on a terrain).",
        "project-magic-circus-action-button-1": "Project page (Itch.io)",

        "project-translimation-title": "Translimation",
        "project-translimation-date": "November 2023",
        "project-translimation-subtitle": "Play as a little slime in all its states",
        "project-translimation-description-1": "This game was created in 48 hours during the <a href=\"https://itch.io/jam/unijam2023\"><strong>Unijam FR 2023</strong></a> event with this year's theme \"Everything transforms\".",
        "project-translimation-description-2": "The idea we had was then to embody a small laboratory slime where its goal is to forge its own freedom by escaping from the lab. But a slime sticks, and doesn't jump high. Don't panic, there are sources of heat and cold that will alter your state. Each state has its advantages and disadvantages ! But be careful not to take too long: each room has its own temperature, and it will constantly bring you back to the same state after a certain time.",
        "project-translimation-action-button-1": "Project page (Itch.io)",

        "project-exploding-tree-title": "Exploding Tree",
        "project-exploding-tree-date": "February 2023",
        "project-exploding-tree-subtitle": "Defend the sacred tree in this tower defense where git got the best of us",
        "project-exploding-tree-description-1": "This game was created in 48 hours in a team of 6 during the <a href=\"https://itch.io/jam/unijam2023\"><strong>Global Game Jam 2023</strong></a> with this year's theme \"Roots\".",
        "project-exploding-tree-description-2": "<p class=\"mb-4\">This game jam was the first for the whole team. The use of GIT (file version management software, essential for working in a team) was also new at the time. It was at this moment that we started to take it in hand.</p><p class = \"mb-4\">The game finally could not be completed, because too many problems were encountered with GIT. Unfortunately, at that time, we did not know enough methods to get out of it, but it is interesting to note that, retrospectively to today, we could have corrected the previous problem with our current mastery.</p>",
        "project-exploding-tree-action-button-1": "Project page (Github)"
    }
}