{
    "fr": {
        "last-updated": "Dernière mise à jour : ",
        
        "job-title": "@AdriKat - Développeur",
        "job-subtitle": "Ingénieur du numérique - Développeur et concepteur de jeux - Développeur de logiciels",
        "nav-profile": "Profil",
        "nav-games": "Mes Jeux",
        "nav-about": "À propos",
        "nav-contact": "Contact",
        "title-profile": "Mon Profil",
        "title-games": "Mes Jeux",
        "title-about": "À propos",
        "title-contact": "Contact",
        "profile-subtitle": "Vous avez un projet en tête dans le domaine du game dev ou du software ?<br>N'hésitez pas à me contacter par mail ou par téléphone !",

        "profile-column-1-head": "Maîtrise de multiples <strong>languages de programmation</strong> parmi...",
        "profile-column-1-1": "C++ (avec notamment <em>Unreal Engine 5</em>)",
        "profile-column-1-2": "C# (avec <em>Unity</em>)",
        "profile-column-1-3": "C",
        "profile-column-1-4": "Python",
        "profile-column-1-5": "Java",
        "profile-column-1-6": "Bash (dans un environnement <em>Linux</em>)",
        "profile-column-1-7": "HTML/CSS/PHP/JavaScript (avec Symphony pour le web)",
        
        "profile-column-2-head": "Maîtrise de multiples <strong>outils</strong> de gestion de projet et burautique parmi...",
        "profile-column-2-1": "Gestionnaire de version GIT (+ LFS)",
        "profile-column-2-2": "Suite Microsoft Office",
        "profile-column-2-3": "Suite Google",
        "profile-column-2-4": "Microsoft Office",

        "portfolio-description": "Mon portfolio regorge de tous les projets auxquels j'ai participé, seul ou en équipe, durant mes études d'ingénieur du numérique à Télécom SudParis, en tant que projet scolaire ou personnel. Vous y trouverez principalement des jeux vidéo dans cette section !",
        "portfolio-warning": "Attention : Si le chargement des projets ne s'est pas faite correctement, veuillez rafraîchir la page.",
        
        "about-p1": "Bonjour et bienvenue sur mon portfolio ! Je m'appelle Adrien Schroedel, passionné par le software et le game dev, j'ai tout naturellement intégré une école (Télécom SudParis) pour devenir ingénieur du numérique...<br/>Tout au long de ma formation, j'ai participé à de nombreux <a href=\"#portfolio\">projets de création de jeux vidéo</a>.",
        "about-p2": "Mon plaisir vient non seulement d'apporter mon expertise sur les moteurs de jeu les plus utilisés sur le marché, mais aussi de collaborer harmonieusement avec une équipe pluridisciplinaire pour offrir une œuvre digne du 10me art à tout type de publics.",
        "about-p3": "Mon rêve est d'intégrer une équipe ambitieuse partageant des valeurs fortes et une cohésion hors du commun. Dès lors que la motivation est présente, je pense que nous pouvons accomplir des merveilles ou comme diraient les jeunes, une <em>masterclass</em>...",

        "cv-button-see": "<i class=\"fa-solid fa-eye me-2\"></i>Voir mon CV !",
        "cv-button-download": "<i class=\"fas fa-download me-2\"></i>Télécharger mon CV !",

        "contact-subtitle": "Une question ? Une offre de stage ou d'emploi dans le game dev ou software ?<br/>N'hésitez pas à me contacter, je vous répondrai dans les plus brefs délais !",

        "projects-button-close":"<i class=\"fas fa-xmark fa-fw\"></i>Fermer",

        "project-find-mocha-title": "Find Mocha",
        "project-find-mocha-date": "Depuis Novembre 2023",
        "project-find-mocha-subtitle": "Un jeu de plateforme 2D où vous incarnez un ours mignon à la recherche de son ami",
        "project-find-mocha-description-1": "<p><strong>Find Mocha</strong> a été mon projet personnel préféré jusqu'à présent. En effet, la motivation pour ce projet était au départ de le livrer en cadeau à un ami très proche. Cela explique d'ailleurs pourquoi la motivation de départ que j'avais pour celui-ci était si élevée.</p>",
        "project-find-mocha-description-2": "<p>Dans ce petit jeu de plateforme tout code fait maison, vous incarnez un petit ours nommé Milk qui explore des montagnes sucrées pour retrouver son ami Mocha.</p><p>Divers types de powerups vous aideront dans votre voyage, mais attention aux monstres de mauvaises pensées !</p><p>Vous pouvez y jouer en téléchargeant le jeu sur GitHub.</p>",
        "project-find-mocha-action-button-1": "Page du projet (GitHub)",

        "project-rupture-title": "Rupture",
        "project-rupture-date": "Janvier - Juin 2024",
        "project-rupture-subtitle": "Un jeu vidéo impactant sur le thème du Développement Durable",
        "project-rupture-description-1": "<p><strong>Rupture</strong> est un projet réalisé par un groupe de 4 étudiants dans le cadre d'une formation d'ingénieur du numérique à Télécom SudParis.</p>",
        "project-rupture-description-2": "<p>Dans ce jeu de type narratif, vous incarnez le point de vue d'un modeste robot observant l'état de la société dans un futur proche. Alors que votre mission simple est d'aider un jeune couple, votre tâche se métamorphose alors de manière inattendue en une mission bien plus importante que de simple divertissement.</p><p>L'objectif principal de ce projet était notamment d'apprendre à utiliser le moteur UnrealEngine 5 pour créer un jeu vidéo impactant sur le thème du Développement Durable.</p><p>Le rapport de notre projet est disponible.</p>",
        "project-rupture-action-button-1": "Télécharger le rapport",
        "project-rupture-action-button-2": "Voir le rapport",

        "project-shipping-time-title": "Shipping Time",
        "project-shipping-time-date": "Avril 2024",
        "project-shipping-time-subtitle": "Contrôlez le temps autant que la météo dans ce jeu de rythme à réaction",
        "project-shipping-time-description-1": "Développé en 48h durant l'évènement <a href=\"https://gate.wp.telecom-sudparis.eu/projet/int-game-jam/\"><strong>INT Game Jam 2024</strong></a> qui a été géré de façon autonome par un groupe de 9 étudiants, <strong>Shipping Time</strong> a été pensé et conçu par une équipe de 5 jammeurs dans le thème de cette année \"Jouer avec le temps\".",
        "project-shipping-time-description-2": "<p class=\"mb-4\">Dans ce jeu de rythme à réaction, vous incarnez un bateau qui doit contrôler le temps autant que la météo pour livrer des colis à temps.</p><p class=\"mb-4\">Ayant eu quelques difficultés techniques, le jeu n'a pas pu être achevé comme nous l'avons souhaité, mais malgré quelques bugs, nous avons été satisfaits d'un jeu ayant une boucle de jeu terminée et qui correspondait au global à ce qu'on attendait.</p>",
        "project-shipping-time-action-button-1": "Page du projet (Itch.io)",

        "project-the-legend-of-blo-title": "The Legend Of Blo : the voice in your head",
        "project-the-legend-of-blo-date": "Janvier 2024",
        "project-the-legend-of-blo-subtitle": "Arrivez au bout de votre quête tout en supportant un narrateur chevronné",
        "project-the-legend-of-blo-description-1": "Développé en 48h durant la <a href=\"https://gate.wp.telecom-sudparis.eu/projet/int-game-jam/\"><strong>Global Game Jam 2024</strong></a>, c'est une équipe de 6 étudiants qui a donné naissance à <strong>The Legend Of Blo : the voice in your head</strong>. Un jeu fourré de bugs (intentionnels ?) orienté narratif où un narrateur plutôt spécial vous accompagne dans votre quête. Ce jeu a été donc réalisé face au thème de l'année \"Make me laugh\".",
        "project-the-legend-of-blo-description-2": "<p class=\"mb-4\">Le projet a été très amusant à produire, nous avons beaucoup rigolé avec toute l'équipe durant le développement de ce jeu. Allant des bugs intentionnels aux non-intentionnels, les rires circulaient sur la table. Nous avons donc appris à reconnaître une chose importante ce jour là : ce n'est pas un bug, c'est une feature !</p><p class=\"mb-4\">Nous avons été très fier du jeu à son état final. Je suis personnellement très fier d'avoir réussi à monter le système de dialogue modulaire pour ce jeu.</p>",
        "project-the-legend-of-blo-action-button-1": "Page du projet (Itch.io)",

        "project-magic-circus-title": "Magic Circus",
        "project-magic-circus-date": "Novembre 2023 - Janvier 2024",
        "project-magic-circus-subtitle": "Guidez et coordonnez vos unités pour capturer le drappeau grâce à leurs compétences spéciales",
        "project-magic-circus-description-1": "Ce projet a été réalisé en duo dans le cadre de notre deuxième année d'école d'ingénieur du numérique, dans le cours d'Architectures et Moteurs de Jeux Vidéos à Télécom SudParis. La création de ce jeu nous a permis de prouver nos compétences en matière d'utilisation du moteur Unity pour créer un jeu simple présentant une qualité minimale.",
        "project-magic-circus-description-2": "Pour son développement, nous avons du associer nos expériences passées avec Unity avec la découverte de nouveaux outils permise par le module proposé par notre école (notamment le Nav-Mesh qui permet la navigation d'un ordinateur sur un terrain).",
        "project-magic-circus-action-button-1": "Page du projet (Itch.io)",

        "project-translimation-title": "Translimation",
        "project-translimation-date": "Novembre 2023",
        "project-translimation-subtitle": "Incarnez un petit slime dans tous ses états",
        "project-translimation-description-1": "Ce jeu a été réalisé en 48 heures à l'occasion de l'évènement <a href=\"https://itch.io/jam/unijam2023\"><strong>Unijam FR 2023</strong></a> avec le thème de cette année \"Tout se tranforme\".",
        "project-translimation-description-2": "L'idée que nous avons eu a été alors d'incarner un petit slime de laboratoire où son but est de se forger sa propre liberté en s'échappant du labo. Mais un slime ça colle, et ça ne saute pas haut. Pas de panique, il existe des sources de chaleur et de froid qui altereront votre état. Chaque état a ses avantages et ses inconvénients ! Mais attention à ne pas prendre trop de temps : chaque salle a sa propre température, et elle vous ramènera constament au même état après un certain temps.",
        "project-translimation-action-button-1": "Page du projet (Itch.io)",

        "project-exploding-tree-title": "Exploding Tree",
        "project-exploding-tree-date": "Février 2023",
        "project-exploding-tree-subtitle": "Défendez l'arbre sacré dans ce tower défense où git à eu raison de nous",
        "project-exploding-tree-description-1": "Ce jeu a été réalisé en 48 heures dans une équipe de 6 à l'occasion de la <a href=\"https://itch.io/jam/unijam2023\"><strong>Global Game Jam 2023</strong></a> avec le thème de cette année \"Roots\".",
        "project-exploding-tree-description-2": "<p class=\"mb-4\">Cette game jam a été la première pour toute l'équipe. L'utilisation de GIT (logiciel de gestion de version de fichier, indispensable pour travailler en équipe) était également nouvelle à ce temps. C'est à ce moment là que nous avons commencé à le prendre en main.</p><p class = \"mb-4\">Le jeu n'a finalement pas pu aboutir, car trop de problèmes avaient été rencontrés avec GIT. Malheureusement, à cet époque, nous ne connaissions pas assez les méthodes pour s'en sortir, mais il est intéressant de remarquer que, restrospectivement à aujourd'hui, nous aurions pu corriger le problème d'avant avec notre maîtrise actuelle.</p>",
        "project-exploding-tree-action-button-1": "Page du projet (Github)"
    },
    "en": {
        "last-updated": "Last update: ",
        
        "job-title": "@AdriKat - Developer",
        "job-subtitle": "Digital engineer - Game developer and designer - Software developer",
        "nav-profile": "Profile",
        "nav-games": "My Games",
        "nav-about": "About",
        "nav-contact": "Contact",
        "title-profile": "My Profile",
        "title-games": "My Games",
        "title-about": "About",
        "title-contact": "Contact",
        "profile-subtitle": "Have a project in mind in the field of game or software dev ?<br>Do not hesitate to contact me by phone or email !",
        
        "profile-column-1-head": "Mastery of multiple <strong>programming languages</strong> including...",
        "profile-column-1-1": "C++ (including <em>Unreal Engine 5</em>)",
        "profile-column-1-2": "C# (with <em>Unity</em>)",
        "profile-column-1-3": "C",
        "profile-column-1-4": "Python",
        "profile-column-1-5": "Java",
        "profile-column-1-6": "Bash (in a <em>Linux</em> environment)",
        "profile-column-1-7": "HTML/CSS/PHP/JavaScript (with Symphony for the web)",
        
        "profile-column-2-head": "Mastery of multiple <strong>project management and office tools</strong> including...",
        "profile-column-2-1": "GIT version manager (+ LFS)",
        "profile-column-2-2": "Microsoft Office Suite",
        "profile-column-2-3": "Google Suite",
        "profile-column-2-4": "Microsoft Office",

        "portfolio-description": "My portfolio is full of all the projects I have been able to carry out, alone or in teams, during my digital engineering studies at Télécom SudParis, as a school or personal project. You will mainly find video games in this section!",
        "portfolio-warning": "Warning: The projects might not load correctly, please refresh the page if that's the case.",
        
        "about-p1": "Hello and welcome to my portfolio ! My name is Adrien Schroedel, passionate about software and game dev, I naturally joined a school (Télécom SudParis) to become a digital engineer...<br/>Throughout my training, I participated in many <a href=\"#portfolio\">video game creation projects</a>.",
        "about-p2": "My pleasure comes not only from bringing my expertise on the most used game engines on the market, but also from harmoniously collaborating with a multidisciplinary team to offer a work worthy of the 10th art to all types of audiences.",
        "about-p3": "My dream is to join an ambitious team sharing strong values and an extraordinary cohesion. As long as motivation is present, I think we can accomplish wonders or as young people would say, a <em>masterclass</em>...",
        
        "cv-button-see": "<i class=\"fa-solid fa-eye me-2\"></i>See my resume !",
        "cv-button-download": "<i class=\"fas fa-download me-2\"></i>Download my resume !",
        
        "contact-subtitle": "A question ? An internship or job offer in game or software dev ?<br/>Do not hesitate to contact me, I will answer you as soon as can !",
        
        "projects-button-close":"<i class=\"fas fa-xmark fa-fw\"></i>Close",

        "project-find-mocha-title": "Find Mocha",
        "project-find-mocha-date": "From November 2023",
        "project-find-mocha-subtitle": "An 2D platformer where you play as a cute bear looking for his friend",
        "project-find-mocha-description-1": "<p><strong>Find Mocha</strong> has been my personal favourite project so far. In fact, the motivation for this project were at first to deliver it as a present to a very close friend. That may explain why the starting motivation I had for this one was that high.</p>",
        "project-find-mocha-description-2": "<p>In this little platformer all code home-made, you play as a little bear named Milk that explores sweet mountains to find his friend Mocha.</p><p>Different types of powerups will help you through your journey, but beware of the bad thoughts monsters !</p><p>You can play by downloading the game on GitHub.</p>",
        "project-find-mocha-action-button-1": "Project page (GitHub)",

        "project-rupture-title": "Rupture",
        "project-rupture-date": "January - June 2024",
        "project-rupture-subtitle": "An impactful video game on the theme of Sustainable Development",
        "project-rupture-description-1": "<p><strong>Rupture</strong> is a project carried out by a group of 4 students as part of a training as a digital engineer at Télécom SudParis.</p>",
        "project-rupture-description-2": "<p>In this narrative-style game, you embody the point of view of a humble robot observing the status of society in the near future. While your simple mission is to help a young couple, your task then unexpectedly metamorphoses into a much more important one than mere entertainment.</p><p>The primary objective of this project was notably to learn how to use the UnrealEngine 5 engine to create an impactful video game on the theme of Sustainable Development.</p><p>The report of our project is available.</p>",
        "project-rupture-action-button-1": "Download the report",
        "project-rupture-action-button-2": "See the report",

        "project-shipping-time-title": "Shipping Time",
        "project-shipping-time-date": "April 2024",
        "project-shipping-time-subtitle": "Control time as much as the weather in this rhythm reaction game",
        "project-shipping-time-description-1": "Developed in 48 hours during the <a href=\"https://gate.wp.telecom-sudparis.eu/projet/int-game-jam/\"><strong>INT Game Jam 2024</strong></a> event which was managed autonomously by a group of 9 students, <strong>Shipping Time</strong> was conceived and designed by a team of 5 jammers in this year's theme \"Playing with time\".",
        "project-shipping-time-description-2": "<p class=\"mb-4\">In this rhythm reaction game, you embody a boat that must control time as much as the weather to deliver packages on time.</p><p class=\"mb-4\">Having had some technical difficulties, the game could not be completed as we wished, but despite some bugs, we were satisfied with a game having a completed gameplay loop and which corresponded globally to what we expected.</p>",
        "project-shipping-time-action-button-1": "Project page (Itch.io)",

        "project-the-legend-of-blo-title": "The Legend Of Blo : the voice in your head",
        "project-the-legend-of-blo-date": "January 2024",
        "project-the-legend-of-blo-subtitle": "Complete your quest while supporting a seasoned narrator",
        "project-the-legend-of-blo-description-1": "Developed in 48 hours during the <a href=\"https://gate.wp.telecom-sudparis.eu/projet/int-game-jam/\"><strong>Global Game Jam 2024</strong></a>, it is a team of 6 students who gave birth to <strong>The Legend Of Blo : the voice in your head</strong>. A game full of bugs (intentional ?) narrative-oriented where a rather special narrator accompanies you in your quest. This game was therefore created in the face of this year's theme \"Make me laugh\".",
        "project-the-legend-of-blo-description-2": "<p class=\"mb-4\">The project was very fun to produce, we laughed a lot with the whole team during the development of this game. From intentional to unintentional bugs, laughter circulated on the table. We therefore learned to recognize an important thing that day: it's not a bug, it's a feature !</p><p class=\"mb-4\">We were very proud of the game in its final state. I am personally very proud to have managed to set up the modular dialogue system for this game.</p>",
        "project-the-legend-of-blo-action-button-1": "Project page (Itch.io)",

        "project-magic-circus-title": "Magic Circus",
        "project-magic-circus-date": "November 2023 - January 2024",
        "project-magic-circus-subtitle": "Guide and coordinate your units to capture the flag using their special skills",
        "project-magic-circus-description-1": "This project was carried out in pairs as part of our second year of digital engineering school, in the Game Architectures and Engines course at Télécom SudParis. The creation of this game allowed us to prove our skills in using the Unity engine to create a simple game with minimal quality.",
        "project-magic-circus-description-2": "For its development, we had to combine our past experiences with Unity with the discovery of new tools made possible by the module offered by our school (notably the Nav-Mesh which allows the navigation of a computer on a terrain).",
        "project-magic-circus-action-button-1": "Project page (Itch.io)",

        "project-translimation-title": "Translimation",
        "project-translimation-date": "November 2023",
        "project-translimation-subtitle": "Play as a little slime in all its states",
        "project-translimation-description-1": "This game was created in 48 hours during the <a href=\"https://itch.io/jam/unijam2023\"><strong>Unijam FR 2023</strong></a> event with this year's theme \"Everything transforms\".",
        "project-translimation-description-2": "The idea we had was then to embody a small laboratory slime where its goal is to forge its own freedom by escaping from the lab. But a slime sticks, and doesn't jump high. Don't panic, there are sources of heat and cold that will alter your state. Each state has its advantages and disadvantages ! But be careful not to take too long: each room has its own temperature, and it will constantly bring you back to the same state after a certain time.",
        "project-translimation-action-button-1": "Project page (Itch.io)",

        "project-exploding-tree-title": "Exploding Tree",
        "project-exploding-tree-date": "February 2023",
        "project-exploding-tree-subtitle": "Defend the sacred tree in this tower defense where git got the best of us",
        "project-exploding-tree-description-1": "This game was created in 48 hours in a team of 6 during the <a href=\"https://itch.io/jam/unijam2023\"><strong>Global Game Jam 2023</strong></a> with this year's theme \"Roots\".",
        "project-exploding-tree-description-2": "<p class=\"mb-4\">This game jam was the first for the whole team. The use of GIT (file version management software, essential for working in a team) was also new at the time. It was at this moment that we started to take it in hand.</p><p class = \"mb-4\">The game finally could not be completed, because too many problems were encountered with GIT. Unfortunately, at that time, we did not know enough methods to get out of it, but it is interesting to note that, retrospectively to today, we could have corrected the previous problem with our current mastery.</p>",
        "project-exploding-tree-action-button-1": "Project page (Github)"
    }
}